Project Path: arc_3xpl01tc0d3r_ProcessInjection_g5ddkn_g

Source Tree:

```txt
arc_3xpl01tc0d3r_ProcessInjection_g5ddkn_g
├── LICENSE
├── ProcessInjection
│   ├── App.config
│   ├── DInvoke
│   │   ├── DynamicInvoke.cs
│   │   ├── Injection
│   │   │   ├── APCQueue.cs
│   │   │   ├── CreateRemoteThread.cs
│   │   │   ├── DLLInjection.cs
│   │   │   ├── DynamicPPIDSpoofing.cs
│   │   │   └── DynamicProcessHollowing.cs
│   │   └── Native.cs
│   ├── DirectSyscalls
│   │   ├── Injection
│   │   │   └── CreateRemoteThread.cs
│   │   └── Syscalls.cs
│   ├── IndirectSyscalls
│   │   ├── IndirectSyscalls.cs
│   │   └── Injection
│   │       └── CreateRemoteThread.cs
│   ├── Native
│   │   ├── Constants.cs
│   │   ├── Delegates.cs
│   │   ├── Enum.cs
│   │   ├── PE.cs
│   │   └── Structs.cs
│   ├── PInvoke
│   │   ├── Injection
│   │   │   ├── APCQueue.cs
│   │   │   ├── CreateRemoteThread.cs
│   │   │   ├── DLLInjection.cs
│   │   │   ├── KernelCallBackTable.cs
│   │   │   ├── PPIDSpoofing.cs
│   │   │   └── ProcessHollowing.cs
│   │   └── Win32API.cs
│   ├── ProcessInjection.csproj
│   ├── Program.cs
│   ├── Properties
│   │   └── AssemblyInfo.cs
│   └── Utils
│       ├── Crypto.cs
│       └── Utils.cs
├── ProcessInjection.sln
└── README.md

```

`LICENSE`:

```
                    GNU GENERAL PUBLIC LICENSE
                       Version 3, 29 June 2007

 Copyright (C) 2007 Free Software Foundation, Inc. <https://fsf.org/>

            public ushort Characteristics;
        }

        [StructLayout(LayoutKind.Explicit)]
        public struct IMAGE_SECTION_HEADER
        {
            [FieldOffset(0)]
            [MarshalAs(UnmanagedType.ByValArray, SizeConst = 8)]
            public char[] Name;
            [FieldOffset(8)]
            public uint VirtualSize;
            [FieldOffset(12)]
            public uint VirtualAddress;
            [FieldOffset(16)]
            public uint SizeOfRawData;
            [FieldOffset(20)]
            public uint PointerToRawData;
            [FieldOffset(24)]
            public uint PointerToRelocations;
            [FieldOffset(28)]
            public uint PointerToLinenumbers;
            [FieldOffset(32)]
            public ushort NumberOfRelocations;
            [FieldOffset(34)]
            public ushort NumberOfLinenumbers;
            [FieldOffset(36)]
            public DataSectionFlags Characteristics;

            public string Section
            {
                get
                {
                    int i = Name.Length - 1;
                    while (Name[i] == 0)
                    {
                        --i;
                    }
                    char[] NameCleaned = new char[i + 1];
                    Array.Copy(Name, NameCleaned, i + 1);
                    return new string(NameCleaned);
                }
            }
        }

        [StructLayout(LayoutKind.Sequential)]
        public struct IMAGE_BASE_RELOCATION
        {
            public uint VirtualAdress;
            public uint SizeOfBlock;
        }

        [StructLayout(LayoutKind.Sequential)]
        public struct PE_META_DATA
        {
            public uint Pe;
            public bool Is32Bit;
            public IMAGE_FILE_HEADER ImageFileHeader;
            public IMAGE_OPTIONAL_HEADER32 OptHeader32;
            public IMAGE_OPTIONAL_HEADER64 OptHeader64;
            public IMAGE_SECTION_HEADER[] Sections;
        }

        [StructLayout(LayoutKind.Sequential)]
        public struct PE_MANUAL_MAP
        {
            public string DecoyModule;
            public IntPtr ModuleBase;
            public PE_META_DATA PEINFO;
        }

        [StructLayout(LayoutKind.Explicit)]
        public struct IMAGE_THUNK_DATA32
        {
            [FieldOffset(0)]
            public uint ForwarderString;
            [FieldOffset(0)]
            public uint Function;
            [FieldOffset(0)]
            public uint Ordinal;
            [FieldOffset(0)]
            public uint AddressOfData;
        }

        [StructLayout(LayoutKind.Explicit)]
        public struct IMAGE_THUNK_DATA64
        {
            [FieldOffset(0)]
            public ulong ForwarderString;
            [FieldOffset(0)]
            public ulong Function;
            [FieldOffset(0)]
            public ulong Ordinal;
            [FieldOffset(0)]
            public ulong AddressOfData;
        }

        [StructLayout(LayoutKind.Explicit)]
        public struct ApiSetNamespace
        {
            [FieldOffset(0x0C)]
            public int Count;

            [FieldOffset(0x10)]
            public int EntryOffset;
        }

        [StructLayout(LayoutKind.Explicit)]
        public struct ApiSetNamespaceEntry
        {
            [FieldOffset(0x04)]
            public int NameOffset;

            [FieldOffset(0x08)]
            public int NameLength;

            [FieldOffset(0x10)]
            public int ValueOffset;

            [FieldOffset(0x14)]
            public int ValueLength;
        }

        [StructLayout(LayoutKind.Explicit)]
        public struct ApiSetValueEntry
        {
            [FieldOffset(0x00)]
            public int Flags;

            [FieldOffset(0x04)]
            public int NameOffset;

            [FieldOffset(0x08)]
            public int NameCount;

            [FieldOffset(0x0C)]
            public int ValueOffset;

            [FieldOffset(0x10)]
            public int ValueCount;
        }

        [StructLayout(LayoutKind.Sequential)]
        public struct LDR_DATA_TABLE_ENTRY
        {
            public Structs.LIST_ENTRY InLoadOrderLinks;
            public Structs.LIST_ENTRY InMemoryOrderLinks;
            public Structs.LIST_ENTRY InInitializationOrderLinks;
            public IntPtr DllBase;
            public IntPtr EntryPoint;
            public uint SizeOfImage;
            public Structs.UNICODE_STRING FullDllName;
            public Structs.UNICODE_STRING BaseDllName;
        }
    }
}

```

`ProcessInjection/Native/Structs.cs`:

```cs
using System;
using System.Linq;
using System.Runtime.InteropServices;
using System.Text;
using System.Threading.Tasks;

namespace ProcessInjection.Native
{
    public static class Structs
    {
        [StructLayout(LayoutKind.Sequential)]
        public struct UNICODE_STRING
        {
            public ushort Length;
            public ushort MaximumLength;
