Project Path: arc_krxdev-kaan_AqHax-CSGO_g412o_y3

Source Tree:

```txt
arc_krxdev-kaan_AqHax-CSGO_g412o_y3
├── LICENSE
├── README.md
└── WindowsClient
    ├── AqHaxCSGO
    │   ├── App.config
    │   ├── AqHaxCSGO.csproj
    │   ├── FodyWeavers.xml
    │   ├── FodyWeavers.xsd
    │   ├── Forms
    │   │   ├── EntryForm.Designer.cs
    │   │   ├── EntryForm.cs
    │   │   ├── EntryForm.resx
    │   │   ├── MainForm.Designer.cs
    │   │   ├── MainForm.cs
    │   │   ├── MainForm.resx
    │   │   ├── TCPForm.Designer.cs
    │   │   ├── TCPForm.cs
    │   │   └── TCPForm.resx
    │   ├── Hacks
    │   │   ├── Aimbot.cs
    │   │   ├── Features
    │   │   │   ├── KnifeChanger.cs
    │   │   │   ├── KnifeChangerAnimationFix.cs
    │   │   │   └── SkinChanger.cs
    │   │   ├── Others.cs
    │   │   └── WallHack.cs
    │   ├── Memory
    │   │   ├── Memory.cs
    │   │   ├── NetvarManager.cs
    │   │   ├── OffsetManager.cs
    │   │   └── SigScanner.cs
    │   ├── Misc
    │   │   ├── Globals.cs
    │   │   ├── Offsets.cs
    │   │   ├── SaveManager.cs
    │   │   ├── SkinObj.cs
    │   │   └── Threads.cs
    │   ├── Objects
    │   │   ├── Classes
    │   │   │   └── CClass.cs
    │   │   ├── ClientDLL.cs
    │   │   ├── EngineDLL.cs
    │   │   ├── Entity
    │   │   │   ├── CBaseCombatWeapon.cs
    │   │   │   ├── CBaseEntity.cs
    │   │   │   ├── CBasePlayer.cs
    │   │   │   ├── CCSPlayer.cs
    │   │   │   └── CEnvTonemapController.cs
    │   │   ├── Managers

        CTeamplayRoundBasedRulesProxy,
        CTEArmorRicochet,
        CTEBaseBeam,
        CTEBeamEntPoint,
        CTEBeamEnts,
        CTEBeamFollow,
        CTEBeamLaser,
        CTEBeamPoints,
        CTEBeamRing,
        CTEBeamRingPoint,
        CTEBeamSpline,
        CTEBloodSprite,
        CTEBloodStream,
        CTEBreakModel,
        CTEBSPDecal,
        CTEBubbles,
        CTEBubbleTrail,
        CTEClientProjectile,
        CTEDecal,
        CTEDust,
        CTEDynamicLight,
        CTEEffectDispatch,
        CTEEnergySplash,
        CTEExplosion,
        CTEFireBullets,
        CTEFizz,
        CTEFootprintDecal,
        CTEFoundryHelpers,
        CTEGaussExplosion,
        CTEGlowSprite,
        CTEImpact,
        CTEKillPlayerAttachments,
        CTELargeFunnel,
        CTEMetalSparks,
        CTEMuzzleFlash,
        CTEParticleSystem,
        CTEPhysicsProp,
        CTEPlantBomb,
        CTEPlayerAnimEvent,
        CTEPlayerDecal,
        CTEProjectedDecal,
        CTERadioIcon,
        CTEShatterSurface,
        CTEShowLine,
        CTesla,
        CTESmoke,
        CTESparks,
        CTESprite,
        CTESpriteSpray,
        CTest_ProxyToggle_Networkable,
        CTestTraceline,
        CTEWorldDecal,
        CTriggerPlayerMovement,
        CTriggerSoundOperator,
        CVGuiScreen,
        CVoteController,
        CWaterBullet,
        CWaterLODControl,
        CWeaponAug,
        CWeaponAWP,
        CWeaponBaseItem,
        CWeaponBizon,
        CWeaponCSBase,
        CWeaponCSBaseGun,
        CWeaponCycler,
        CWeaponElite,
        CWeaponFamas,
        CWeaponFiveSeven,
        CWeaponG3SG1,
        CWeaponGalil,
        CWeaponGalilAR,
        CWeaponGlock,
        CWeaponHKP2000,
        CWeaponM249,
        CWeaponM3,
        CWeaponM4A1,
        CWeaponMAC10,
        CWeaponMag7,
        CWeaponMP5Navy,
        CWeaponMP7,
        CWeaponMP9,
        CWeaponNegev,
        CWeaponNOVA,
        CWeaponP228,
        CWeaponP250,
        CWeaponP90,
        CWeaponSawedoff,
        CWeaponSCAR20,
        CWeaponScout,
        CWeaponSG550,
        CWeaponSG552,
        CWeaponSG556,
        CWeaponShield,
        CWeaponSSG08,
        CWeaponTaser,
        CWeaponTec9,
        CWeaponTMP,
        CWeaponUMP45,
        CWeaponUSP,
        CWeaponXM1014,
        CWorld,
        CWorldVguiText,
        DustTrail,
        MovieExplosion,
        ParticleSmokeGrenade,
        RocketTrail,
        SmokeTrail,
        SporeExplosion,
        SporeTrail
    };
}

```

`WindowsClient/AqHaxCSGO/Objects/Structs/GlowObject.cs`:

```cs
using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Runtime.InteropServices;
using AqHaxCSGO.MemoryManagers;
using static AqHaxCSGO.Offsets;

namespace AqHaxCSGO.Objects.Structs
{
    [StructLayout(LayoutKind.Explicit)]
    public struct GlowObject
    {
        [FieldOffset(0x00)]
        public int NextFreeSlot;
        [FieldOffset(0x04)]
        public int EntityPointer;
        [FieldOffset(0x08)]
        public float r;
        [FieldOffset(0x0C)]
        public float g;
        [FieldOffset(0x10)]
        public float b;
        [FieldOffset(0x14)]
        public float a;

        [FieldOffset(0x18)]
        public int unk1;
        [FieldOffset(0x1C)]
        public int unk2;

        [FieldOffset(0x20)]
        public float BloomAmount;
        [FieldOffset(0x24)]
        public float LocalPlayerIs0_3;
        [FieldOffset(0x28)]
        public bool m_bRenderWhenOccluded;
        [FieldOffset(0x29)]
        public bool m_bRenderWhenUnoccluded;
        [FieldOffset(0x2A)]
        public bool m_bFullBloom;

        [FieldOffset(0x2B)]
        public byte unk3;

        [FieldOffset(0x2C)]
        public int FullBloomStencilValue;
        [FieldOffset(0x30)]
        public int m_nGlowStyle;
        [FieldOffset(0x34)]
        public int SplitScreenSlot;

        public static int GetSize()
        {
            return 0x38;
        }

        public static int Ptr
        {
            get
            {
                return Memory.Read<int>(Memory.clientBase + dwGlowObjectManager);
            }
        }
    };

    public struct RenderColor
    {
        public byte r;
        public byte g;
        public byte b;
        public byte a;

        public RenderColor(byte r, byte g, byte b, byte a)
        {
            this.r = r;
            this.g = g;
            this.b = b;
            this.a = a;
        }
    };
}

```

`WindowsClient/AqHaxCSGO/Objects/Structs/HitboxGroup.cs`:

```cs
using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace AqHaxCSGO.Objects.Structs
{
    /**
     * All bones will be implemented later on !
     */
    public enum HitboxGroup
    {
