Project Path: arc_M3351AN_Echinoidea_20cv5ozy

Source Tree:

```txt
arc_M3351AN_Echinoidea_20cv5ozy
├── App.config
├── Cheats
│   ├── Aimassistant.cs
│   ├── Aimbot.cs
│   ├── Bunnyhop.cs
│   ├── Triggerbot.cs
│   └── Visuals.cs
├── Classes
│   ├── Engine.cs
│   ├── Entity.cs
│   ├── Keys.cs
│   ├── Maths.cs
│   ├── Mouse.cs
│   ├── Offsets.cs
│   ├── Settings.cs
│   └── Structs.cs
├── Forms
│   ├── Menu.Designer.cs
│   ├── Menu.cs
│   └── Menu.resx
├── LICENSE
├── Main.cs
├── Program.cs
├── Properties
│   ├── AssemblyInfo.cs
│   ├── Resources.Designer.cs
│   ├── Resources.resx
│   ├── Settings.Designer.cs
│   ├── Settings.settings
│   └── app.manifest
├── README.md
├── Utilities
│   ├── Checks.cs
│   ├── G.cs
│   ├── Memory.cs
│   ├── OffsetUpdater.cs
│   └── Tools.cs
├── ZBase.csproj
├── ZBase.sln
├── amd.ico
├── echnoidea.ico
└── packages.config

```

`App.config`:

```config
<?xml version="1.0" encoding="utf-8"?>
<configuration>
    <startup> 
        <supportedRuntime version="v4.0" sku=".NETFramework,Version=v4.8"/>
    </startup>
</configuration>

```

`Cheats/Aimassistant.cs`:

```cs
using System;
using System.Collections.Generic;
using System.Linq;
using System.Numerics;
using System.Text;
using System.Threading;
using System.Threading.Tasks;
using ZBase.Classes;
using ZBase.Utilities;
using Math = ZBase.Classes.Maths;

namespace ZBase.Cheats
{
    public class Aimassistant
    {

        public static void Run()
        {

        public int m_flDefuseLength { get; set; }
        public int m_flFallbackWear { get; set; }
        public int m_flFlashDuration { get; set; }
        public int m_flFlashMaxAlpha { get; set; }
        public int m_flNextPrimaryAttack { get; set; }
        public int m_flTimerLength { get; set; }
        public int m_hActiveWeapon { get; set; }
        public int m_hMyWeapons { get; set; }
        public int m_hObserverTarget { get; set; }
        public int m_hOwner { get; set; }
        public int m_hOwnerEntity { get; set; }
        public int m_iAccountID { get; set; }
        public int m_iClip1 { get; set; }
        public int m_iCompetitiveRanking { get; set; }
        public int m_iCompetitiveWins { get; set; }
        public int m_iCrosshairId { get; set; }
        public int m_iEntityQuality { get; set; }
        public int m_iFOV { get; set; }
        public int m_iFOVStart { get; set; }
        public int m_iGlowIndex { get; set; }
        public int m_iHealth { get; set; }
        public int m_iItemDefinitionIndex { get; set; }
        public int m_iItemIDHigh { get; set; }
        public int m_iObserverMode { get; set; }
        public int m_iShotsFired { get; set; }
        public int m_iState { get; set; }
        public int m_iTeamNum { get; set; }
        public int m_lifeState { get; set; }
        public int m_nFallbackPaintKit { get; set; }
        public int m_nFallbackSeed { get; set; }
        public int m_nFallbackStatTrak { get; set; }
        public int m_nForceBone { get; set; }
        public int m_nTickBase { get; set; }
        public int m_rgflCoordinateFrame { get; set; }
        public int m_szCustomName { get; set; }
        public int m_szLastPlaceName { get; set; }
        public int m_thirdPersonViewAngles { get; set; }
        public int m_vecOrigin { get; set; }
        public int m_vecVelocity { get; set; }
        public int m_vecViewOffset { get; set; }
        public int m_viewPunchAngle { get; set; }
    }

    public class RootObject
    {
        public int timestamp { get; set; }
        public Signatures signatures { get; set; }
        public Netvars netvars { get; set; }
    }
}

```

`Classes/Settings.cs`:

```cs
using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace ZBase.Classes
{
    public class Settings
    {
        public bool BunnyhopEnabled;
        public int BunnyhopAccuracy;
        public bool TriggerbotEnabled;
        public bool ESP;
        public bool SnapLine;
        public bool HealthBar;
        public bool AimEnabled;
    }
}

```

`Classes/Structs.cs`:

```cs
using System;
using System.Collections.Generic;
using System.Linq;
using System.Runtime.InteropServices;
using System.Text;
using System.Threading.Tasks;
using ZBase.Classes;

namespace ZBase.Classes
{
    

    [StructLayout(LayoutKind.Explicit)]
    public struct GlowStruct
    {
        [FieldOffset(0x00)]
        public int EntityPointer;
        [FieldOffset(0x4)]
        public float r;
        [FieldOffset(0x8)]
        public float g;
        [FieldOffset(0xC)]
        public float b;
        [FieldOffset(0x10)]
        public float a;
        [FieldOffset(0x14)]
        public int jnk1;
        [FieldOffset(0x18)]
        public int jnk2;
        [FieldOffset(0x1C)]
        public float BloomAmount;
        [FieldOffset(0x20)]
        public int jnk3;

        [FieldOffset(0x24)]
        public bool m_bRenderWhenOccluded;
        [FieldOffset(0x25)]
        public bool m_bRenderWhenUnoccluded;
        [FieldOffset(0x2C)]
        public bool m_bFullBloom;
    };

    public struct RECT
    {
        public int left, top, right, bottom;
    }
    [StructLayout(LayoutKind.Explicit)]
    public struct Enemy_t
    {

        [FieldOffset(0x100)]//m_iHealth
        public int Health ;

        [FieldOffset(0xF4)]//m_iTeamNum
        public int Team;

        [FieldOffset(0x93D)]//m_bSpotted
        public bool Spotted;

        [FieldOffset(0x138)]//m_vecOrigin
        public System.Numerics.Vector3 Position;
    }
    public struct LocalPlayer
    {
        public static int Base { get; set; }
        public static int LifeState { get; set; }
        public static int Health { get; set; }
        public static bool Dormant { get; set; }
        public static int Flags { get; set; }
        public static int MoveType { get; set; }
        public static int Team { get; set; }
        public static int ShotsFired { get; set; }
        public static int CrosshairID { get; set; }
        public static System.Numerics.Vector3 Position { get; set; }
        public static System.Numerics.Vector3 AimPunch { get; set; }
        public static System.Numerics.Vector3 VecView { get; set; }
    }

    public struct Enemy
    {
        public int Base { get; set; }
        public int Health { get; set; }
        public int Team { get; set; }
        public bool Dormant { get; set; }
