Project Path: arc_supermanc88_Document_6aaqgw9u

Source Tree:

```txt
arc_supermanc88_Document_6aaqgw9u
├── ASM
│   ├── C调用汇编.md
│   ├── Linux下C和ASM混编.md
│   ├── 标志寄存器.md
│   ├── 调用约定.md
│   └── 除法逆向.md
├── C++
│   ├── C++构造函数和析构函数.md
│   ├── C++虚函数.md
│   ├── Resharp快捷键汇总.md
│   ├── images
│   │   ├── 函数模板
│   │   │   └── image-20200520182738355.png
│   │   └── 类模板
│   │       └── image-20200520183250293.png
│   ├── 函数名是函数地址吗.md
│   ├── 函数模板.md
│   ├── 类模板.md
│   └── 重载.md
├── CMake
│   ├── CMake.md
│   ├── makefile.md
│   └── 编译ollvm.md
├── Docker
│   └── Docker安装.md
├── GO
│   ├── Go第三方静态库使用方式.docx
│   ├── go语言静态库的编译和使用.md
│   ├── images
│   │   ├── 工作区和GOPATH
│   │   │   ├── 2fdfb5620e072d864907870e61ae5f3c.png
│   │   │   └── image-20210128150559844.png
│   │   └── 程序实体的那些事
│   │       └── 5e68210d5639f9e42738f21bd9eb1e89.png
│   ├── 命令源码文件.md
│   ├── 工作区和GOPATH.md
│   ├── 库源码文件.md
│   └── 程序实体的那些事.md
├── GameMaker
│   └── The Asset Editors
│       ├── Animation Curve.md
│       ├── Objects
│       │   ├── Object Events
│       │   │   ├── Async Events
│       │   │   │   ├── Audio Playback.md
│       │   │   │   └── images
│       │   │   │       └── Audio Playback
│       │   │   │           └── Async_AudioPlayback.png
│       │   │   ├── Draw Events.md
│       │   │   ├── Event Order.md
│       │   │   ├── Gesture Events.md
│       │   │   ├── Other Events.md
│       │   │   └── images
│       │   │       ├── Draw Events

- [Linux System Calls](https://cs.lmu.edu/~ray/notes/syscalls/)
- [X86 Assembly/Interfacing with Linux](https://en.wikibooks.org/wiki/X86_Assembly/Interfacing_with_Linux)
```

`ASM/标志寄存器.md`:

```md
## 标志寄存器

|标志位|名称|解释|
|--|--|--|
|CF|进位标志/Carry Flag|当运算结果的最高有效位有进位或借位时，CF=1，无符号数超出存储范围叫做进位|
|PF|奇偶标志位/Parity Flag|当运算结果字节中`1`的个数为零个或偶数个时，PF=1|
|AF|辅助进位标志/Auxiliary Carry Flag|算数操作结果的第三位（从0开始计数）如果产生了进位或者借位则将其置为1，否则置为0，常在BCD(binary-codedecimal)算术运算中被使用|
|ZF|零标志/Zero Flag|当运算结果为0，ZF=1|
|SF|符号标志/Sign Flag|当运算结果最高位为1时，SF=1|
|TF|跟踪标志/Trace Flag|当TF被设置为1时，CPU进入单步模式，所谓单步模式就是CPU在每执行一步指令后都产生一个单步中断。主要用于程序的调试。8086/8088中没有专门用来置位和清零TF的命令，需要用其他办法。|
|IF|中断标志/Interrupt Flag|决定CPU是否响应外部可屏蔽中断请求。IF为1时，CPU允许响应外部的可屏蔽中断请求|
|DF|方向标志/Direction Flag|决定串操作指令执行时有关指针寄存器调整方向。当DF为1时，串操作指令按递减方式改变有关存储器指针值，每次操作后使SI、DI递减。|
|OF|溢出标志/Overflow Flag|有符号数超出存储范围叫做溢出|

[标志寄存器](https://web.archive.org/web/20101212091435/http://www.ltivs.ilc.edu.tw/kocp/mpu/m3/m3-1-3.htm)


```

`ASM/调用约定.md`:

```md
# 函数调用约定

__cdecl __stdcall  __fastcall


## __cdecl

C语言调用约定，函数返回`ret`，函数体中包含`add esp,xxx`等指令，堆栈是由调用函数平衡的。可接收数量不定的参数，如printf


## __stdcall

标准调用约定，函数返回`ret 0x10h`，参数从右至左传入堆栈，是由函数体自己平衡的。


## __fastcall

快速调用约定，函数返回`ret 0x10h`，参数最左边两个传入`ecx`、`edx`，其余参数从右至左传入堆栈，是由函数体自己平衡的。



https://bbs.pediy.com/thread-224583.htm
```

`C++/C++构造函数和析构函数.md`:

```md
## 类的构造函数

### 默认的构造函数

类的构造函数是类的一种特殊的成员函数，它会在每次创建类的新对象时执行

构造函数的名称和类的名称是完全相同的，并且不会返回任何类型，也不会返回`void`。构造函数可用于为某些成员变量设置初始值。

```
class Base
{
public:
	Base();
};

Base::Base()
{
	printf("这里是Base类的构造函数\n");
}

int main()
{
    Base b;
    return 0;
}
```
上述代码执行时会打印构造函数里的语句。

### 带参数的构造函数

默认的构造函数没有任何参数，但如果需要，构造函数也可以带有参数。这样在创建对象时就会给对象赋初始值。

```
class Base
{
public:
	Base(int x);
	void PrintA();
private:
	int a;
};

Base::Base(int x)
{
	a = x;
	printf("这里是Base类的构造函数\n");
}

void Base::PrintA()
{
	printf("a的值为%d\n", a);
}

int main()
{
    Base b(5);
    b.PrintA();
    return 0;
}
```

### 使用初始化列表来初始化字段

```
class Base
{
public:
	Base(int x, int y);
	void PrintA();
private:
	int a;
	int b;
};

Base::Base(int x, int y):a(x),b(y)
{
    // 上面的初始化列表和 a = x; b = y; 等同
	printf("这里是Base类的构造函数\n");
}

void Base::PrintA()
{
	printf("a=%d,b=%d\n", a,b);
}
```

## 析构函数

```
class Base
{
public:
	Base(int x, int y);
	void PrintA();
	~Base()
	{
		printf("这里是Base类的析构函数\n");
	}
private:
	int a;
	int b;
};
```
类的析构函数会在每次删除所创建的对象时执行。
```

`C++/C++虚函数.md`:

```md

在编译器中打开内存布局：

C/C++ -> 命令行 在其他选项上填写 `/d1 reportAllClassLayout`


C++的虚函数主要作用是“运行时多态”，父类中提供虚函数的实现，为子类提供默认的函数实现。

子类可以重写父类的虚函数实现子类的特殊化。

例：
```
class A
{
	int a;
	int b;
public:
	virtual void Say()
	{
		printf("A Say\n");
	}
	virtual void Say2()
	{
		printf("A Say2\n");
	}

	void Say3()
	{
		printf("A Say3\n");
	}
};

class B : public A
{
	int c;
public:
	void Say()
	{
		printf("B Say\n");
	}
	void Say3()
	{
		printf("B Say3\n");
	}
};

class C : public A
{
	int d;
public:
	virtual void Say()
	{
		printf("C Say\n");
	}
};

class D : public B, public C
{
	int e;
public:
	virtual  void Say()
	{
		printf("D Say\n");
	}
};
```

内存布局如下：

```
class A	size(12):
	+---
 0	| {vfptr}
 4	| a
 8	| b
	+---

A::$vftable@:
	| &A_meta
	|  0
 0	| &A::Say
 1	| &A::Say2

A::Say this adjustor: 0
A::Say2 this adjustor: 0
```

先看类A，虚表指针放在第一位（类内偏移从0开始），后面依次是成员变量，成员变量依据声明的顺序进行排列，成员函数不占内存空间。

紧接着是虚表在内存中的分布，下面列出了虚函数，左侧的0和1是这个虚函数的序号,如果还有更多的虚函数，会依次列出来。

编译器是在构造函数中创建这个虚表指针和虚表的。

那么编译器是如何利用虚表指针与虚表来实现多态的呢？是这样的，**<span style="color:red">当创建一个含有虚函数的父类的对象时，编译器在对象构造时将虚表指针指向父类的虚函数；同样，当创建子类的对象时，编译器在构造函数里将虚表指针（子类只有一个虚表指针，它来自父类）指向子类的虚表（这个虚表里面的虚函数入口地址是子类的）。<span>**

所以，如果是调用`A *a = new B();`,生成的是子类的对象，在构造时，子类对象的虚指针指向的是子类的虚表，接着由`B*`到`A*`的转换并没有改变虚表指针，所以这时候`a->Say()`实际上是`b->Say()`，它在构造的时候就已经指向了子类的`Say`，所以调用的是子类的虚函数，这就是多态了。

```
class B	size(16):
	+---
 0	| +--- (base class A)
 0	| | {vfptr}
 4	| | a
 8	| | b
	| +---
12	| c
	+---

B::$vftable@:
	| &B_meta
	|  0
 0	| &B::Say
 1	| &A::Say2

B::Say this adjustor: 0
```

看类B，可以看到，虚表指针被继承了，且仍位于内存排布的起始处，下面是父类的成员变量a和b，接下来是子类的成员变量c，注意虚表指针只有一个，子类并没有再生成虚表指针了。

接下来看一下虚表，我们重写了父类的`Say`虚函数，虚表的0号是子类的`Say`，而1号是从父类继承下来的`Say2`。也就是说，如果定义了B的对象，那么在构造是，虚表指针就会指向这个虚表，以后如果是调用Say，那么会从子类中寻找对应的虚函数，如果是调用Say2，那么会从父类中寻找对应的虚函数。

下面看一下以下代码的运行结果：

```
int main()
{
	B * pb = (B*)new A();           // 虚表指针指向A的虚表
	pb->Say();                      // A Say
	pb->Say2();                     // A Say2
	pb->Say3();                     // Say3是普通函数，经过转换，Say3其实是B类的函数

	A * pa = (A*)new B();
	pa->Say();
	pa->Say2();
	pa->Say3();
}
```

多重继承内存布局：

```
class D	size(36):
	+---
 0	| +--- (base class B)
 0	| | +--- (base class A)
 0	| | | {vfptr}
 4	| | | a
 8	| | | b
	| | +---
12	| | c
	| +---
16	| +--- (base class C)
16	| | +--- (base class A)
16	| | | {vfptr}
20	| | | a
24	| | | b
	| | +---
28	| | d
	| +---
32	| e
	+---

D::$vftable@B@:
	| &D_meta
	|  0
 0	| &D::Say
 1	| &A::Say2

D::$vftable@C@:
	| -16
 0	| &thunk: this-=16; goto D::Say
 1	| &A::Say2

D::Say this adjustor: 0
```

多重继承中含有多个虚表指针，此示例中包含两个虚表指针。

本文暂不讨论虚继承。
```

`C++/Resharp快捷键汇总.md`:

```md
# Resharp快捷键汇总


## 常用的快捷键

Ctrl + N  search everywhere

Ctrl + B 跳到变量申明处

Ctrl + Alt + F 格式化代码

Alt + F7 查找变量，方法的引用

Ctrl + Shift + F4 关闭查找结果tab



## 编辑

Ctrl + Space 代码完成

Ctrl + Shift + Space代码完成

Ctrl + Alt + Space代码完成

Ctrl + P 显示参数信息

Alt + Insert 生成构造函数，属性，重载成员函数，实现接口

Ctrl + Alt + J 生成if,try..catch,#region块

Ctrl + / 注释及取消//注释

Ctrl + Shift + / 注释及取消/**/注释

Ctrl + W 增量选择块

Ctrl + Shift + W 增量反选

Alt + Enter 显示错误的修正方法

Ctrl + Alt + F 格式化代码

Ctrl + Alt + O 根据指示修改优化

